//#############################################################################
//  ファイル名：PlayerOperate_Spwan.cs
//  最終編集者：稲垣達也
//
//  Partial によって分けられたファイルの一つ
//  コースに復帰する処理を定義する
//#############################################################################
using UnityEngine;
using UnityEngine.Events;
using System.Collections;

public partial class PlayerOperateV2 : BaseObject {

    private const float     BOTTOM_Y         = -4f; //復帰フラグを立てるＹ座標
    private const int       SPWANSTATESIZE   = 5;   //復帰ステートの最大数
    private StateManager    m_SpwanStep;
    private int             m_RespwonStep;  //復活ステップ

    //初期化===================================================================
    private void SpwanStart() {
    }
    //更新=====================================================================
    private void SpwanFunc() {
    }

    //ステート関数/////////////////////////////////////////////////////////////
    //ステップ０１=============================================================
    //  操作をロック
    //  キャラを縮小
    //  単色で発光   < レンダラーを管理するものがいる
    //  カメラを固定（キャラは落下し続ける）
    //=========================================================================
    private void SpawnStep01Init() {
    }
    private void SpawnStep01Update() {
    }
    //ステップ０２=============================================================
    //  発光体から粒子を拡散   < エフェクトがいる。エフェクトを管理するものがいる
    //  フェードアウト         < フェードマネージャを使えばいいかな？
    //=========================================================================
    private void SpawnStep02Init() {
    }
    private void SpawnStep02Update() { 
    }
    //ステップ０３=============================================================
    //  記憶したアンカーデータから復帰用座標にキャラを移動
    //  フェードイン
    //  粒子を集結
    //  単色で発光
    //  キャラを拡大
    //=========================================================================
    private void SpawnStep03Init() {
    }
    private void SpawnStep03Update() {
    }
    //ステップ４===============================================================
    //  復帰フラグを解除
    //  操作のロックを解除
    //=========================================================================
    private void SpawnStep04Init() {
    }
    private void SpawnStep04Update() {
    }

}
